{
  "title": {
    "media": {
      "url": "./ml-history.png/",
      "caption": "History of machine learning.",
      "credit": "Sketch note by <a href=\"https://www.twitter.com/girlie_mac\">Tonomi Imura</a>"
    },
    "text": {
      "headline": "Machine Learning<br/> 1950 - Now",
      "text": "<p>The history of artificial intelligence (AI) as a field is intertwined with the history of machine learning, as the algorithms and computational advances that underpin ML fed into the development of AI. It is useful to remember that, while these fields as distinct areas of inquiry began to crystallize in the 1950s, important <a href=\"https://en.wikipedia.org/wiki/Timeline_of_machine_learning\">algorithmic, statistical, mathematical, computational and technical discoveries</a> predated and overlapped this era. In fact, people have been thinking about these questions for <a href=\"https://en.wikipedia.org/wiki/History_of_artificial_intelligence\">hundreds of years</a>: this article discusses the historical intellectual underpinnings of the idea of a \"thinking machine.\"</p>"
    }
  },
  "events": [
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "year": "1950"
      },
      "text": {
        "headline": "Machines that think",
        "text": "<p>Alan Turing, a truly remarkable person who was voted <a href=\"https://en.wikipedia.org/wiki/Icons:_The_Greatest_Person_of_the_20th_Century\">by the public in 2019</a> as the greatest scientist of the 20th century, is credited as helping to lay the foundation for the concept of a \"machine that can think.\" He grappled with naysayers and his own need for empirical evidence of this concept in part by creating the <a href=\"https://www.bbc.com/news/technology-18475646\">Turing Test</a>.</p>"
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "year": "1956"
      },
      "text": {
        "headline": "Dartmouth Summer Research Project",
        "text": "<p>\"The Dartmouth Summer Research Project on artificial intelligence was a seminal event for artificial intelligence as a field,\" and it was here that the term \"artificial intelligence\" was coined (<a href=\"https://250.dartmouth.edu/highlights/artificial-intelligence-ai-coined-dartmouth\">source</a>).</p>\n\n<blockquote>\n  <p>Every aspect of learning or any other feature of intelligence can in principle be so precisely described that a machine can be made to simulate it.</p>\n</blockquote>\n\n<hr>\n\n<p>The lead researcher, mathematics professor John McCarthy, hoped \"to proceed on the basis of the conjecture that every aspect of learning or any other feature of intelligence can in principle be so precisely described that a machine can be made to simulate it.\" The participants included another luminary in the field, Marvin Minsky.</p>\n\n<p>The workshop is credited with having initiated and encouraged several discussions including \"the rise of symbolic methods, systems focussed on limited domains (early expert systems), and deductive systems versus inductive systems.\" (<a href=\"https://wikipedia.org/wiki/Dartmouth_workshop\">source</a>).</p>"
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "year": "1956"
      },
      "end_date": {
        "year": "1974"
      },
      "text": {
        "headline": "The golden years",
        "text": "<p>From the 1950s through the mid \"70s, optimism ran high in the hope that AI could solve many problems. In 1967, Marvin Minsky stated confidently that \"Within a generation ... the problem of creating \"artificial intelligence\" will substantially be solved.\" (Minsky, Marvin (1967), Computation: Finite and Infinite Machines, Englewood Cliffs, N.J.: Prentice-Hall)</p>\n\n<p>natural language processing research flourished, search was refined and made more powerful, and the concept of \"micro-worlds\" was created, where simple tasks were completed using plain language instructions.</p>\n<p>Research was well funded by government agencies, advances were made in computation and algorithms, and prototypes of intelligent machines were built.</p>"
      }
    },
    {
      "media": {
        "url": "./eliza.png",
        "caption": "A version of Eliza, a chatbot",
        "credit": ""
      },
      "start_date": {
        "year": "1964"
      },
      "end_date": {
        "year": "1967"
      },
      "text": {
        "headline": "ELIZA, an early \"chatterbot\"",
        "text": "<p>One of them is <a href=\"https://en.wikipedia.org/wiki/ELIZAt\">ELIZA</a>, a very early version of ChatGPT, which could converse with people and act as a primitive \"therapist\"</p>"
      }
    },
    {
      "media": {
        "url": "./shakey.jpg",
        "caption": "Shakey in 1972",
        "credit": ""
      },
      "start_date": {
        "year": "1966"
      },
      "end_date": {
        "year": "1972"
      },
      "text": {
        "headline": "Shakey the robot",
        "text": "<p>Or <a href=\"https://en.wikipedia.org/wiki/Shakey_the_robot\">Shakey the robot</a>, which is known as who could maneuver and decide how to perform tasks \"intelligently\"..</p>"
      }
    },
    {
      "media": {
        "url": "https://www.youtube.com/watch?v=QAJz4YKUwqw",
        "caption": "Blocks world with SHRDLU",
        "credit": "Youtube"
      },
      "start_date": {
        "year": "1968"
      },
      "end_date": {
        "year": "1970"
      },
      "text": {
        "headline": "The \"Blocks world\"",
        "text": "<p>\"Blocks world\" was an example of a micro-world where blocks could be stacked and sorted, and experiments in teaching machines to make decisions could be tested. Advances built with libraries such as <a href=\"https://wikipedia.org/wiki/SHRDLU\">SHRDLU</a> helped propel language processing forward.</p>"
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "year": "1974"
      },
      "end_date": {
        "year": "1980"
      },
      "text": {
        "headline": "The \"AI Winter\"",
        "text": "<ul>\n  <li><strong>Limitations</strong>. Compute power was too limited.</li>\n  <li><strong>Combinatorial explosion</strong>. The amount of parameters needed to be trained grew exponentially as more was asked of computers, without a parallel evolution of compute power and capability.</li>\n  <li><strong>Paucity of data</strong>. There was a paucity of data that hindered the process of testing, developing, and refining algorithms.</li>\n  <li><strong>Are we asking the right questions?</strong>. The very questions that were being asked began to be questioned. Researchers began to field criticism about their approaches:\n    <ul>\n      <li>Turing tests came into question by means, among other ideas, of the 'chinese room theory' which posited that, \"programming a digital computer may make it appear to understand language but could not produce real understanding.\" (<a href=\"https://plato.stanford.edu/entries/chinese-room/\">source</a>)</li>\n      <li>The ethics of introducing artificial intelligences such as the \"therapist\" ELIZA into society was challenged.</li>\n    </ul>\n  </li>\n</ul>\n\n<hr>\n\n<p>At the same time, various AI schools of thought began to form. A dichotomy was established between <a href=\"https://wikipedia.org/wiki/Neats_and_scruffies\">\"scruffy\" vs. \"neat AI\"</a> practices. <em>Scruffy</em> labs tweaked programs for hours until they had the desired results. <em>Neat</em> labs \"focused on logic and formal problem solving\". ELIZA and SHRDLU were well-known <em>scruffy</em> systems. In the 1980s, as demand emerged to make ML systems reproducible, the <em>neat</em> approach gradually took the forefront as its results are more explainable.</p>"
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "year": "1980"
      },
      "end_date": {
        "year": "1990"
      },
      "text": {
        "headline": "Expert systems",
        "text": "<p>As the field grew, its benefit to business became clearer, and in the 1980s so did the proliferation of 'expert systems'. \"Expert systems were among the first truly successful forms of artificial intelligence (AI) software.\" (<a href=\"https://wikipedia.org/wiki/Expert_system\">source</a>).</p>\n\n<p>This type of system is actually <em>hybrid</em>, consisting partially of a rules engine defining business requirements, and an inference engine that leveraged the rules system to deduce new facts.</p>\n\n<p>This era also saw increasing attention paid to neural networks.</p>"
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "year": "1987"
      },
      "end_date": {
        "year": "1993"
      },
      "text": {
        "headline": "AI \"Chill\"",
        "text": "<p>The proliferation of specialized expert systems hardware had the unfortunate effect of becoming too specialized. The rise of personal computers also competed with these large, specialized, centralized systems. The democratization of computing had begun, and it eventually paved the way for the modern explosion of big data.</p>"
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "year": "1993"
      },
      "end_date": {
        "year": "2011"
      },
      "text": {
        "headline": "New era",
        "text": "<p>This epoch saw a new era for ML and AI to be able to solve some of the problems that had been caused earlier by the lack of data and compute power. The amount of data began to rapidly increase and become more widely available, for better and for worse, especially with the advent of the smartphone around 2007. Compute power expanded exponentially, and algorithms evolved alongside. The field began to gain maturity as the freewheeling days of the past began to crystallize into a true discipline.</p>"
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "year": "2011"
      },
      "text": {
        "headline": "Now",
        "text": "<p>Today machine learning and AI touch almost every part of our lives. This era calls for careful understanding of the risks and potentials effects of these algorithms on human lives. As Microsoft's Brad Smith has stated, \"Information technology raises issues that go to the heart of fundamental human-rights protections like privacy and freedom of expression. These issues heighten responsibility for tech companies that create these products. In our view, they also call for thoughtful government regulation and for the development of norms around acceptable uses\" (<a href=\"https://www.technologyreview.com/2019/12/18/102365/the-future-of-ais-impact-on-society/\">source</a>).</p>"
      }
    }
  ]
}
